app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "cast" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Man of Steel 2"], ["cast", "Henry Cavill, Amy Adams"], ["updated_at", 2017-02-25 16:00:31 UTC], ["id", 9]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "cast", "director", "duration", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)