app/controllers/reviews_controller.rb

    def create
        @review = @movie.reviews.new(review_params)
        if @review.save
---
INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Gabriel"], ["stars", 1], ["comment", "Ok la"], ["movie_id", 1], ["created_at", 2017-02-27 20:02:46 UTC], ["updated_at", 2017-02-27 20:02:46 UTC]]

    def edit
        @review = @movie.reviews.find(params[:id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 1], ["LIMIT", 1]]

    def update
        @review = @movie.reviews.find(params[:id])
        if @review.update(review_params)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 4], ["id", 5], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "I'm batman. Nanananana"], ["updated_at", 2017-02-28 21:31:21 UTC], ["id", 5]]